Revit 2024 API
FamilyItemFactory.NewDiameterDimension Method
 Creates a new diameter dimension object using the default dimension type.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Dimension NewDiameterDimension(
	View view,
	Reference arcRef,
	XYZ origin
)
Visual Basic
Public Function NewDiameterDimension ( _
	view As View, _
	arcRef As Reference, _
	origin As XYZ _
) As Dimension
Visual C++
public:
Dimension^ NewDiameterDimension(
	View^ view,
	Reference^ arcRef,
	XYZ^ origin
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view in which the dimension is to be visible.
arcRef
Type: Autodesk.Revit.DB.Reference
 Geometric reference of the arc to which the dimension is to be bound.
origin
Type: Autodesk.Revit.DB.XYZ
 The point where the witness line of the diameter dimension will lie.
Return Value
If creation was successful the new diameter dimension is returned, otherwise an exception with failure information will be thrown.
Remarks
 The currently user set default style is used for the created dimension.
Remarks
 The dimension will be created on default place.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when any input argument is null.
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the argument arcRef is invalid.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the creation failed.
See Also
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace